<template>
 <div>
   <button>+86</button>
   <div class="tab">
     <ul class="elTab">
      <li class="title" v-for="item in title" :key="item">{{item}}</li>
      <!-- <li class="title">A</li>
      <li class="title">B</li>
      <li class="title">C</li>
      <li class="title">D</li>
      <li class="title">E</li>
      <li class="title">F</li>
      <li class="title">G</li>
      <li class="title">H</li>
      <li class="title">I</li>
      <li class="title">J</li>
      <li class="title">K</li>
      <li class="title">L</li>
      <li class="title">M</li>
      <li class="title">N</li>
      <li class="title">O</li>
      <li class="title">P</li>
      <li class="title">Q</li>
      <li class="title">R</li>
      <li class="title">S</li>
      <li class="title">T</li>
      <li class="title">U</li>
      <li class="title">V</li>
      <li class="title">W</li>
      <li class="title">X</li>
      <li class="title">Y</li>
      <li class="title">Z</li> -->
    </ul>
    <div class="zoneTab">
      <ul class="zones" >
        <li class="zone" v-for="itemHot in hot" :key="itemHot">{{itemHot}}</li>
      </ul>
      <ul class="zones" >
        <li class="zone" v-for="itemA in A" :key="itemA">{{itemHA}}</li>
      </ul>
    </div>
    <img src="../assets/images/close.png" class="close"/>
   </div>
   
 </div>
</template>

<script>
export default {
   data() {
      return {
        checked: 'hot',
        title: ["HOT","A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"],
        hot: ["澳大利亚61","澳门853","德国49","法国33","韩国82","加拿大1","美国1","马来西亚40","日本81","泰国66","新西兰64","新加坡65","香港852","意大利39","英国44","中国86"],
        A: ["埃及20","奥地利43","阿根廷54","澳大利亚61","阿富汗93","阿尔及利亚213","安哥拉244","埃塞俄比亚251","爱尔兰353","阿尔巴尼亚355","爱沙尼亚372","安道尔共和国376","澳门853","阿曼968","阿拉伯联合酋长国971","阿塞拜疆994","安圭拉岛1264","安提瓜和巴布达1268"],
        B: ["比利时32","波兰48","秘鲁51","巴西55","巴基斯坦92","布基纳法索226","贝宁229","布隆迪257","博茨瓦纳267","冰岛354","保加利亚359","白俄罗斯375","伯利兹501","巴拿马507","玻利维亚591","巴拉圭595","巴布亚新几内亚675","巴林973","巴哈马1242","巴巴多斯1246","百慕大群岛1441","波多黎各1787"],
        C: [],
        D: ["丹麦45","德国49","多哥228","多米尼加共和国1890"],
        E: ["俄罗斯7","厄瓜多尔593"],
        F: ["法国33","菲律宾63","芬兰358","法属圭亚那594","斐济679","法属波利尼西亚689"],
        G: ["古巴53","哥伦比亚57","冈比亚220","刚果242","哥斯达黎加506","圭亚那592","格鲁吉亚995","关岛1671","格林纳达1809"],
        H: ["荷兰31","韩国82","哈萨克斯坦327","洪都拉斯504","海地509"],
        I: ["埃及20","奥地利43","阿根廷54","澳大利亚61","阿富汗93","阿尔及利亚213","安哥拉244","埃塞俄比亚251","爱尔兰353","阿尔巴尼亚355","爱沙尼亚372","安道尔共和国376","澳门853","阿曼968","阿拉伯联合酋长国971","阿塞拜疆994","安圭拉岛1264","安提瓜和巴布达1268"],
        J: ["加拿大1","几内亚224","加纳233","加蓬241","吉布提253","津巴布韦263","吉尔吉斯坦331","捷克420","柬埔寨855"],
        K: ["科特迪瓦225","喀麦隆237","肯尼亚254","库克群岛682","科威特965","卡塔尔974","开曼群岛1345"],
        L: ["罗马尼亚40","利比亚218","利比里亚231","留尼旺262","莱索托266","卢森堡352","立陶宛370","拉脱维亚371","列支敦士登423","老挝856"],
        M: ["美国1","墨西哥52","马来西亚60","摩洛哥212","马里223","毛里求斯230","莫桑比克258","马达加斯加261","马拉维265","马耳他356","摩尔多瓦373","摩纳哥377","马提尼克596","孟加拉国880","马尔代夫960","蒙古976","蒙特塞拉特岛1664"],
        N: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        O: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        P: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        Q: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        R: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        S: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        T: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        U: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        V: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        W: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        X: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        Y: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"],
        Z: ["埃及0020","奥地利0043","阿根廷0054","澳大利亚0061","阿富汗0093","阿尔及利亚00213","安哥拉00244","埃塞俄比亚00251","爱尔兰00353","阿尔巴尼亚00355","爱沙尼亚00372","安道尔共和国00376","澳门00853","阿曼00968","阿拉伯联合酋长国00971","阿塞拜疆00994","安圭拉岛001264","安提瓜和巴布达001268"]

      };
    }
}
</script>


<style>
  .tab{
    width: 432px;
    padding: 10px 15px;
    box-shadow: 0px 0px 12px 2px rgba(77, 77, 77, 1);
    border: 1px solid rgba(255, 255, 255, 1);
    margin: auto;
    margin-top: 20px;
    position: relative;
  }
  .tab .elTab{
    display: flex;
    width: 410px;
    border-bottom: 1px solid #f1e5e5;
  }
  .tab .elTab .title{
    height: 30px;
    box-sizing: border-box;
    color: #303133;
    margin-right: 1px;
    background-color: #FFF;
    font-size: 12px;
    clear: none;
    cursor: pointer;
    line-height: 30px;
    font-weight: normal;
    font-family: Arial,"microsoft yahei";
    letter-spacing: 0;
    padding: 0 4.86px 0 0;
  }
  .tab .zoneTab{
   
  }
  .tab .zoneTab .zones{
    display: flex;
    flex-wrap: wrap;

  }
  .tab .zoneTab .zone{
    width: 135px;
    height: 30px;
    box-sizing: border-box;
    color: #303133;
    background-color: #FFF;
    font-size: 12px;
    cursor: pointer;
    line-height: 26px;
    font-weight: normal;
    font-family: Arial,"microsoft yahei";
    letter-spacing: 0;
    padding: 0 2.43px;
    text-align: left;
  }
  .tab .close{
    position: absolute;
    top: 4%;
    right: 3%;
  }
</style>